{"uri": "https://twitter.com/waitbutwhy/status/1922861200137728082", "datetime": "2025-05-15 03:46:49+00:00", "source": 1, "label": null, "content": "b'A question that began with cell phones'", "content_size_bytes": 38}
{"uri": "https://twitter.com/waitbutwhy/status/1922774494323581387", "datetime": "2025-05-14 22:02:17+00:00", "source": 1, "label": null, "content": "b'One of the most egregious examples of paid-for politicians forcibly holding back a wildly beneficial technology to protect corporate interests. It is an affront to freedom, stripping citizens of the option to spare animals and the environment in their meat consumption.'", "content_size_bytes": 269}
{"uri": "https://twitter.com/waitbutwhy/status/1921637429607293015", "datetime": "2025-05-11 18:44:00+00:00", "source": 1, "label": null, "content": "b\"Level 4: You see an IG video of someone complaining about the exact thing you've been complaining about\\xe2\\x80\\x94 and what you don't realize is the entire thing is AI, targeted specifically to you because the phone has been spying on you, and you're the only person seeing this video.\"", "content_size_bytes": 277}
{"uri": "https://twitter.com/waitbutwhy/status/1921634547319332984", "datetime": "2025-05-11 18:32:32+00:00", "source": 1, "label": null, "content": "b\"I FaceTimed my mother and showed her this and she didn't like it\"", "content_size_bytes": 64}
{"uri": "https://twitter.com/waitbutwhy/status/1920561589515686133", "datetime": "2025-05-08 19:28:59+00:00", "source": 1, "label": null, "content": "b'I feel like popes should be Italian or at least Spanish or something. The pope being American kind of kills the vibe for me.'", "content_size_bytes": 124}
{"uri": "https://twitter.com/waitbutwhy/status/1920206278967677347", "datetime": "2025-05-07 19:57:07+00:00", "source": 1, "label": null, "content": "b'Yup. Assignments should be like \\xe2\\x80\\x9cuse AI to do ___ complex project\\xe2\\x80\\x9d and then have an oral component where the student explains each step of the process they used and their thought process behind it. Schools should prepare kids to accomplish things with the tools of their world.'", "content_size_bytes": 281}
{"uri": "https://twitter.com/waitbutwhy/status/1920204948526055493", "datetime": "2025-05-07 19:51:50+00:00", "source": 1, "label": null, "content": "b'When I got a new computer last year it asked me to pick an icon for my login screen so I hastily clicked the ice cube emoji and moved on. Now I learn that for a year I\\xe2\\x80\\x99ve been showing up as an ice cube whenever I text or call someone.'", "content_size_bytes": 236}
