{"uri": "https://twitter.com/paulg/status/1924762783893106974", "datetime": "2025-05-20 09:43:02+00:00", "source": 1, "label": null, "content": "b'Something I explained to 13 yo: There is no intrinsically fair price for any commodity, just the market price. Most people have no problem understanding that. Until the commodity is labor. Then suddenly it becomes hard to understand.'", "content_size_bytes": 233}
{"uri": "https://twitter.com/paulg/status/1924468108917379168", "datetime": "2025-05-19 14:12:06+00:00", "source": 1, "label": null, "content": "b\"If you design your startup to appeal to investors instead of users, you may well succeed in raising your first round. But when you try to raise your second, without good growth numbers, you'll suddenly find you're not appealing to investors after all.\"", "content_size_bytes": 251}
{"uri": "https://twitter.com/paulg/status/1924405848358395952", "datetime": "2025-05-19 10:04:42+00:00", "source": 1, "label": null, "content": "b'Thank you @GaryLineker for having a conscience, and the strength to listen to it.'", "content_size_bytes": 81}
{"uri": "https://twitter.com/paulg/status/1924224045886669228", "datetime": "2025-05-18 22:02:17+00:00", "source": 1, "label": null, "content": "b'Romanian voters just did the same thing as Canadian and Australian voters. Trump may be dragging down the US, but he seems to be saving the rest of the world.'", "content_size_bytes": 158}
{"uri": "https://twitter.com/paulg/status/1924044502362144911", "datetime": "2025-05-18 10:08:51+00:00", "source": 1, "label": null, "content": "b\"I was curious how well I have an essay loaded into my head when I'm working on it, so I tried reproducing the one I'm currently writing from memory. I reproduced it almost perfectly. But the differences suggest I don't have it memorized like lines in a play.\"", "content_size_bytes": 258}
{"uri": "https://twitter.com/paulg/status/1924055950463262806", "datetime": "2025-05-18 10:54:20+00:00", "source": 1, "label": null, "content": "b'There are few jobs where you could have more effect on the world, or work with better people, than this one.'", "content_size_bytes": 108}
